#
* ------------------------------------------------------------------------------
* use 100 CE+2BB events, perform parameter scans                             

|-------------+------------+-------------+------------------+--------+-------+--------------+----------+----------|
| maxChi2Seed | maxChi2Par | maxChi2Perp | maxChi2SeedDelta | sigmaR | rCore | T(DF)/T(FBH) | N(sh_12) | N(sh_14) |
|-------------+------------+-------------+------------------+--------+-------+--------------+----------+----------|
|          20 |         16 |          12 |               20 |    1.5 |   2.0 | 0.984/0.476  |    98589 |      217 |
|          20 |         12 |          12 |               20 |    1.5 |   2.0 | 0.946/0.472  |    98326 |      195 |
|          20 |         10 |          12 |               20 |    1.5 |   2.0 | 0.926/0.478  |    97904 |      192 |
|          16 |         10 |          12 |               20 |    1.5 |   2.0 | 0.915/0.482  |    97843 |      176 |
|          12 |         10 |          12 |               20 |    1.5 |   2.0 | 0.922/0.481  |    97460 |      166 |
|         *12 |         12 |          12 |               20 |    1.5 |   2.0 | 0.970/0.497  |    97770 |     170* |
|          12 |         12 |          12 |               25 |    1.5 |   2.0 | 0.949/0.504  |    97797 |      181 |
|          12 |         12 |          12 |               16 |    1.5 |   2.0 | 0.953/0.483  |    97643 |      172 |
|          12 |         12 |          12 |               20 |    1.5 |   2.5 | 0.919/0.482  |    97999 |      177 |
|-------------+------------+-------------+------------------+--------+-------+--------------+----------+----------|
* choose (97770:170) as a working point
* delta-electron flagging rates:                                             
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| particle    | dataset       | N(flagged) |  N(tot) | fraction | previous | comments                               |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| e- (p<20)   | cele0b2s41r04 |    1301472 | 1732628 |    0.751 |          |                                        |
|             | mnbs0b1s41r04 |    1550361 | 2073658 |    0.748 |          |                                        |
|             | pbar1b0s41r04 |      11017 |   19522 |    0.564 |          |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| e- (20<80)  | cele0b2s41r04 |      73149 |  225029 |    0.325 |          | Michel peak                            |
|             | mnbs0b1s41r04 |      85543 |  273569 |    0.313 |          | Michel peak                            |
|             | pbar1b0s41r04 |       3062 |    7438 |    0.412 |          |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| CE (80-110) | cele0b2s41r04 |       2029 |   51095 |    0.040 |    0.045 |                                        |
|             | pbar1b0s41r04 |         17 |     914 |    0.019 |          |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| protons     | cele0b2s41r04 |      10740 |  439099 |    0.024 |     0.03 |                                        |
|             | mnbs0b1s41r04 |       5668 |  525896 |    0.011 |          |                                        |
|             | pbar1b0s41r04 |         37 |    2373 |    0.016 |          |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| positrons   | cele0b2s41r04 |      81398 |  100872 |    0.807 |          | Michel peak present - what is it ?     |
|             | mnbs0b1s41r04 |     100432 |  123874 |    0.811 |          | where the Michel peak is coming from ? |
|             | pbar1b0s41r04 |       9192 |   16347 |    0.562 |          |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| muons       | pbar1b0s41r04 |       2692 |   65342 |    0.041 |    0.045 |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
| pions       | pbar1b0s41r04 |       6649 |   53903 |    0.123 |     0.14 |                                        |
|-------------+---------------+------------+---------+----------+----------+----------------------------------------|
#+tblfm:$5=$3/$4;%5.3f::

* test1 job CE+2BB                                                           

================================================================================================================================
TimeTracker printout (sec)                        Min           Avg           Max         Median          RMS         nEvts   
================================================================================================================================
Full event                                    0.00651548     0.0921473     0.619391      0.0729746     0.0715703      1354    
--------------------------------------------------------------------------------------------------------------------------------
source:RootInput(read)                        0.000130878   0.000225554   0.000526369   0.000222219   4.79952e-05     1354    
p1:PBTFSD:ProtonBunchTimeFromStrawDigis       0.000145617   0.000691007   0.00275051    0.000601022   0.000399106     1354    
p1:makeSH:StrawHitReco                        0.000268009   0.00134527    0.00675363    0.00117546    0.00078595      1354    
p1:makePH:CombineStrawHits                    2.2971e-05    0.000233527   0.00152401    0.000179518   0.000189792     1354    
p1:FlagBkgHits:FlagBkgHits                    6.3679e-05    0.000479494   0.00258945    0.000384453   0.000339919     1354    
p1:DeltaFinder:DeltaFinder                    7.0428e-05    0.000932951   0.00978689    0.000612197   0.00104075      1354    
[art]:TriggerResults:TriggerResultInserter     6.253e-06    8.24363e-06   4.0401e-05    8.0945e-06    1.95813e-06     1354    
end_path:DeltaFinderAna:DeltaFinderAna        0.00530785     0.0881227     0.597213      0.0698234     0.068892       1354    
================================================================================================================================

